### Forest: Snapshot Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.daily_snapshot.data.local_file.init: Reading...
module.daily_snapshot.data.external.sources_tar: Reading...
module.daily_snapshot.data.local_file.init: Read complete after 0s [id=6bef5ead62d0a8c671220b6e72bfc23cf50a3c5e]
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Reading...
module.daily_snapshot.data.digitalocean_project.forest_project: Reading...
module.daily_snapshot.data.external.sources_tar: Read complete after 0s [id=-]
module.daily_snapshot.data.local_file.sources: Reading...
module.daily_snapshot.data.local_file.sources: Read complete after 0s [id=738b01e22bd2a83fd32281176569fb2a8265a79d]
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/14512061520513425405]
module.daily_snapshot.digitalocean_droplet.forest: Refreshing state... [id=373895428]
module.daily_snapshot.digitalocean_firewall.forest-firewall: Refreshing state... [id=f1a53356-9b57-4283-86e3-4faf07457e6f]
module.daily_snapshot.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.daily_snapshot.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.daily_snapshot.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-09-09T06:14:34Z" -> (known after apply)
      ~ disk                 = 300 -> (known after apply)
      ~ id                   = "373895428" -> (known after apply)
      ~ ipv4_address         = "188.166.164.11" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.5" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "forest-snapshot"
      ~ price_hourly         = 0.19494 -> (known after apply)
      ~ price_monthly        = 131 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ ssh_keys             = [ # forces replacement
          - "9d:f6:f8:05:f7:c2:72:a2:b7:ce:f8:3e:71:12:2e:09",
          - "cb:ca:60:61:a9:ba:e0:a0:ba:95:35:2d:48:f3:c2:05",
          + "88:95:97:77:a1:1f:bf:e8:3a:84:20:7d:a9:4c:74:6d",
          + "e4:0e:85:24:75:5e:f3:b1:77:c4:7d:a2:3a:1e:00:b1",
            # (18 unchanged elements hidden)
        ]
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      ~ urn                  = "do:droplet:373895428" -> (known after apply)
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.daily_snapshot.digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [
          - 373895428,
        ] -> (known after apply)
        id              = "f1a53356-9b57-4283-86e3-4faf07457e6f"
        name            = "forest-snapshot"
        tags            = []
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.daily_snapshot.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:373895428",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "188.166.164.11",
        ],
      + [
          + (known after apply),
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>